flight-booker/app/controllers/flights_controller.rb

SELECT "airports".* FROM "airports"
SELECT "flights".* FROM "flights" ORDER BY departure_airport_id, "flights"."date" ASC
---
  def index
    @airports = Airport.all.map { |a| [a.name, a.id] }
    @passengers = (1..4).to_a

    if params[:search]
      @number_of_passengers = params[:search][:passengers]
      date = "#{params[:search][:date]['date(3i)']}/"\
             "#{params[:search][:date]['date(2i)']}/"\
             "#{params[:search][:date]['date(1i)']}"
      @flights = Flight.get_flights(params[:search][:from],
                 params[:search][:to], DateTime.parse(date))
      @active_form = true
    else
      if params[:sort] || session[:sort]
        session[:sort] = params[:sort] if params[:sort]
        @flights = Flight.all.order(session[:sort], :date)