odin-kittens/app/controllers/kittens_controller.rb

  def index
    @kittens = Kitten.all
---
SELECT "kittens".* FROM "kittens"

  def create
    @kitten = Kitten.new(kitten_params)

    if @kitten.save
---
INSERT INTO "kittens" ("age", "created_at", "cuteness", "name", "softness", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["age", 8], ["created_at", Thu, 04 Sep 2014 11:04:10 UTC +00:00], ["cuteness", "very cute"], ["name", "Dingli"], ["softness", "not so soft"], ["updated_at", Thu, 04 Sep 2014 11:04:10 UTC +00:00]]

  def destroy
    @kitten.destroy
---
DELETE FROM "kittens" WHERE "kittens"."id" = ?  [["id", 1]]

    def set_kitten
      @kitten = Kitten.find(params[:id])
---
SELECT "kittens".* FROM "kittens" WHERE "kittens"."id" = ? LIMIT 1  [["id", "1"]]