private-events/app/controllers/events_controller.rb

  def new
    user = User.find(session[:signed])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create
    user = User.find(session[:signed])
    @event = user.created_events.build(event_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "events" ("created_at", "creator_id", "date", "description", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def attend
    if session[:signed] != nil
      user = User.find(session[:signed])
      event_attendees = Event.find(params[:id]).attendees
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "1"]]