private-events/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 29 Aug 2014 10:02:56 UTC +00:00], ["name", "Maria"], ["password", "ass"], ["updated_at", Fri, 29 Aug 2014 10:02:56 UTC +00:00]]