private-events/app/views/users/show.html.erb

<h4>It's <%= User.find(params[:id]).name %></h4>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]